[
    
    {	"movieName":"Penguins Of Madagascar", 
    	"cast" : "Tom McGrath, Chris Miller, Chris Knights",
    	"director" : "Simon Smith, Eric Darnell" ,
    	"genre" : "Comedy",
    	"release" :  "27-11-2014",
    	"runningTime" : "92 minutes",
    	"distributor" : "Fox" ,
    	"language" : "English(Sub: Chinese)",
    	"synopsis" : "Discover the secrets of the most entertaining and mysterious birds in the global espionage game: Skipper, Kowalski, Rico and Private now must join forces with the chic spy organization, the North Wind, led by Agent Classified (we could tell you his name, but then... you know), voiced by Benedict Cumberbatch, to stop the villainous Dr. Octavius Brine, voiced by John Malkovich, from taking over the world.",
    	"cinema" : ["The Cathay", "West Mall", "Cineleisure", "JEM", "Causeway Point", "AMK HUB", "Downtown East"],
    	"imageLink" : "http://www.impawards.com/2014/posters/penguins_of_madagascar_xlg.jpg",
    	"trailerLink" : "http://youtu.be/retX8Wj7JdM" } , 

    {	"movieName":"Rise Of The Legend", 
    	"cast" : "Sammo Hung, Eddie Peng Yuyan, Wang Luodan, Jing Boran",
    	"director" : "Chow Hin Yeung" ,
    	"genre" : "Action Drama",
    	"release" :  "27-11-2014",
    	"runningTime" : "130 minutes",
    	"distributor" : "GVP" ,
    	"language" : "Mandarin(Sub: English,Chinese)",
    	"synopsis" : "This i",
    	"cinema" : ["The Cathay", "West Mall", "Cineleisure", "JEM", "Causeway Point", "AMK HUB", "Downtown East"],
    	"imageLink" : "http://twitchfilm.com/assets/2014/06/RiseOfTheLegend_TeaserPoster_01.jpg",
    	"trailerLink" : "http://youtu.be/GpCBdrstsCo" } , 

    {	"movieName":"Horrible Bosses 2", 
    	"cast" : "Jason Bateman, Charlie Day, Jason Sudeikis",
    	"director" : "Sean Anders" ,
    	"genre" : "Comedy",
    	"release" :  "27-11-2014",
    	"runningTime" : "109 minutes",
    	"distributor" : "WB" ,
    	"language" : "English(Sub: Chinese)",
    	"synopsis" : "Fed up with answering to higher-ups, Nick (Bateman), Dale (Day) and Kurt (Sudeikis) decide to become their own bosses by launching their own business in Horrible Bosses 2. But a slick investor soon pulls the rug out from under them. Outplayed and desperate, and with no legal recourse, the three would-be entrepreneurs hatch a misguided plan to kidnap the investors adult son and ransom him to regain control of their company.",
    	"cinema" : [ "The Cathay", "West Mall", "Cineleisure", "JEM", "Causeway Point", "AMK HUB", "Downtown East"],
    	"imageLink" : "http://collider.com/wp-content/uploads/horrible-bosses-2-poster-1.jpg",
    	"trailerLink" : "http://youtu.be/D_PQhGHnU8Q" } , 

    {	"movieName":"The Hunger Games: Mockingjay Part 1", 
    	"cast" : "Jennifer Lawrence, Sam Claflin, Josh Hutcherson",
    	"director" : "Francis Lawrence" ,
    	"genre" : "Action Adventure",
    	"release" :  "20-11-2014",
    	"runningTime" : "123 minutes",
    	"distributor" : "Cathay" ,
    	"language" : "English(Sub: Chinese)",
    	"synopsis" : "The worldwide phenomenon of The Hunger Games continues to set the world on fire with The Hunger Games: Mockingjay - Part 1, which finds Katniss Everdeen (Jennifer Lawrence) in District 13 after she literally shatters the games forever. Under the leadership of President Coin (Julianne Moore) and the advice of her trusted friends, Katniss spreads her wings as she fights to save Peeta (Josh Hutcherson) and a nation moved by her courage. The Hunger Games: Mockingjay - Part 1 is directed by Francis Lawrence from a screenplay by Danny Strong and Peter Craig and produced by Nina Jacobson's Color Force in tandem with producer Jon Kilik. The novel on which the film is based is the third in a trilogy written by Suzanne Collins that has over 65 million copies in print in the U.S. alone.",
    	"cinema" : ["The Cathay", "West Mall", "Cineleisure", "JEM", "Causeway Point", "AMK HUB", "Downtown East"],
    	"imageLink" : "http://collider.com/wp-content/uploads/the-hunger-games-mockingjay-part-1-final-poster.jpg",
    	"trailerLink" : "http://youtu.be/3PkkHsuMrho" } , 

    {	"movieName":"Disney's Big Hero 6", 
    	"cast" : "Ryan Potter, Scott Adsit, T.J. Miller, Jaime Chung, Damon Wayans, Jr., Genesis Rodriguez, Daniel Henney",
    	"director" : "Don Hall, Chris Williams" ,
    	"genre" : "Animation",
    	"release" :  "13-11-2014",
    	"runningTime" : "108 minutes",
    	"distributor" : "WDS" ,
    	"language" : "English(Sub: Chinese)",
    	"synopsis" : "With all the heart and humor audiences expect from Walt Disney Animation Studios, Big Hero 6 is an action-packed comedy-adventure about robotics prodigy Hiro Hamada, who learns to harness his genius - thanks to his brilliant brother Tadashi and their like-minded friends: adrenaline junkie Go Go Tamago, neatnik Wasabi, chemistry whiz Honey Lemon and fanboy Fred. When a devastating turn of events catapults them into the midst of a dangerous plot unfolding in the streets of San Fransokyo, Hiro turns to his closest companion - a robot named Baymax - and transforms the group into a band of high-tech heroes determined to solve the mystery. Inspired by the Marvel comics of the same name, and featuring comic-book style action, Big Hero 6 is directed by Don Hall (Winnie the Pooh) and Chris Williams (Bolt), and produced by Roy Conli (Tangled). The film hits theaters in 3D on 13 November, 2014.",
    	"cinema" : ["The Cathay", "West Mall", "Cineleisure", "JEM", "Causeway Point", "AMK HUB", "Downtown East"],
    	"imageLink" : "http://www.vixenvarsity.com/wp-content/uploads/2014/07/Big-Hero-6-poster.jpg",
    	"trailerLink" : "http://youtu.be/8IdMPpKMdcc" } , 

    {	"movieName":"Ungli", 
    	"cast" : "Emraan Hashmi, Kangana Ranaut, Randeep Hooda, Neil Bhoopalam, Angad Bedi, Sanjay Dutt",
    	"director" : "Rensil D'Silva" ,
    	"genre" : "Drama",
    	"release" :  "28-11-2014",
    	"runningTime" : "113 minutes",
    	"distributor" : "AE" ,
    	"language" : "Hindi",
    	"synopsis" : "Abhay (a crime journalist), Maya (a medical intern), Goti (a computer hardware specialist) and Kalim (the owner of a garage) are four friends. They began their friendship when they met at a gym, run by their trainer Ricky. Over the period of a couple of years, all five of them have become a close knit gang. Then one day, Ricky is run over by a young man called Anshuman Dayal. Dayal was drinking and driving, but since his father was a fixer for the police, he got away scott-free. When the friends find that the system is too corrupt to give them justice, they go into a deep depression. However, the four friends decide to do something about it. They train and get in peak physical form. And they become vigilantes. By day they are ordinary citizens of the country. By night, they don masks and turn the tables against the very corrupt system that created them. They do all this in a manner which makes fun of these departments and officials. And they call themselves: UNGLI GANG.",
    	"cinema" : ["The Cathay", "West Mall", "Cineleisure", "JEM", "Causeway Point", "AMK HUB", "Downtown East"],
    	"imageLink" : "http://images.indianexpress.com/2014/09/ungli-first-look-poster759e.jpg?w=759&h=1100",
    	"trailerLink" : "http://youtu.be/Nl1UPQbIQ4s" } , 

    {	"movieName":"Interstellar", 
    	"cast" : "Matthew McConaughey, Anne Hathaway, Jessica Chastain",
    	"director" : "Christopher Nolan" ,
    	"genre" : "Sci-Fi",
    	"release" :  "05-11-2014",
    	"runningTime" : "169 minutes",
    	"distributor" : "WB" ,
    	"language" : "English(Sub: Chinese)",
    	"synopsis" : "With our time on Earth coming to an end, a team of explorers undertakes the most important mission in human history: traveling beyond this galaxy to discover whether mankind has a future among the stars.",
    	"cinema" : ["The Cathay", "West Mall", "Cineleisure", "JEM", "Causeway Point", "AMK HUB", "Downtown East"],
    	"imageLink" : "http://collider.com/wp-content/uploads/interstellar-poster1.jpg",
    	"trailerLink" : "http://youtu.be/zSWdZVtXT7E" } , 

    {	"movieName":"Dearest", 
    	"cast" : "Vicki Zhao, Huang Bo, Tong Dawei, Hao Lei",
    	"director" : "Peter Chan" ,
    	"genre" : "Drama",
    	"release" :  "20-11-2014",
    	"runningTime" : "123 minutes",
    	"distributor" : "GVP" ,
    	"language" : "Mandarin(Sub: English, Chinese)",
    	"synopsis" : "Shenzhen, Southern China - When their 3-year old son goes missing. TIAN WEN-JUN and his ex-wife, LU XIAO-JUN, find their ordinary lives thrown into complete turmoil. Overwhelmed with guilt, they struggle to cope with the never-ending nightmare that most people would be unable to comprehend. They comb through half the country in search of their child but to no avail. The waiting is the hardest thing to endure but they persevere, clinging to the faintest glimmer of hope – even if it comes in the form of a conman’s lie. Hope is the only thing that gives them a reason to live.",
    	"cinema" : ["The Cathay", "West Mall", "Cineleisure", "JEM", "Causeway Point", "AMK HUB", "Downtown East"],
    	"imageLink" : "http://4.bp.blogspot.com/-9QaX8YHsyms/VGoO_XTa5JI/AAAAAAAH4eY/D0pzlyFUCik/s1600/Dearest_SG_Poster%2B(A3).jpg",
    	"trailerLink" : "http://youtu.be/_0RY43JJ-uY" } , 

    {	"movieName":"Women Who Flirt", 
    	"cast" : "Zhou Xun, Huang Xiaoming, Sonia Sui, Sie Yi Lin",
    	"director" : "Pang Ho-Cheung" ,
    	"genre" : "Drama",
    	"release" :  "27-11-2014",
    	"runningTime" : "97 minutes",
    	"distributor" : "SB" ,
    	"language" : "Mandarin(Sub: English,Chinese)",
    	"synopsis" : "Most women know that flirting can sometimes be the most effective way to get what they want, especially when it comes to men. However, flirting is an art that takes talent, and isn’t so easy to come by for some… ZHANG HUI (Zhou Xun) has a crush on her fellow classmate, XIAO GONG (Huang Xiaoming). However, family pressure to succeed forces him to focus more on his studies rather than relationships, delegating Zhang Hui to the role of “just ? friends”. But Zhang Hui doesn’t give up that easily. After graduation she finds work in Shanghai in order to stay close to Xiao Gong. Matters are complicated, however, when Xiao Gong returns from a business trip to Taiwan with a new girlfriend, BEI BEI (Sonia Sui). Unable to admit defeat, Zhang Hui seeks the help from a college classmate and her group of friends that have mastered the art of flirting. Overnight, Zhang Hui’s appearance, demeanor, and silks of seduction improve dramatically.",
    	"cinema" : ["The Cathay", "West Mall", "Cineleisure", "JEM", "Causeway Point", "AMK HUB", "Downtown East"],
    	"imageLink" : "http://content7.flixster.com/movie/11/18/16/11181609_800.jpg",
    	"trailerLink" : "http://youtu.be/retX8Wj7JdM" } ,

    {	"movieName":"Dumb And Dumber To", 
    	"cast" : "Jim Carrey, Jeff Daniels, Kathleen Turner",
    	"director" : "Peter Farrelly, Bobby Farrelly" ,
    	"genre" : "Comedy",
    	"release" :  "13-11-2014",
    	"runningTime" : "108 minutes",
    	"distributor" : "GVP" ,
    	"language" : "English(Sub: Chinese)",
    	"synopsis" : "Jim Carrey and Jeff Daniels reprise their signature roles as Lloyd and Harry in the sequel to the smash hit that took the physical comedy and kicked it in the nuts: Dumb and Dumber To. The original films directors, Peter and Bobby Farrelly, take Lloyd and Harry on a road trip to find a child Harry never knew he had and the responsibility neither should ever, ever be given. ",
    	"cinema" : ["The Cathay", "West Mall", "Cineleisure", "JEM", "Causeway Point", "AMK HUB", "Downtown East"],
    	"imageLink" : "http://www.impawards.com/2014/posters/dumb_and_dumber_to_ver8_xlg.jpg",
    	"trailerLink" : "http://youtu.be/bQ4mbHt41mg?list=UUXzTlfmCw4aPk3l_HQQPqhA" } ,

    {	"movieName":"Happy Ending", 
    	"cast" : "Saif Ali Khan, Ileana D’Cruz, Kalki Koechlin, Ranvir Shorey, Govinda",
    	"director" : "Raj & DK" ,
    	"genre" : "Drama",
    	"release" :  "21-11-2014",
    	"runningTime" : "136 minutes",
    	"distributor" : "Eros" ,
    	"language" : "Hindi",
    	"synopsis" : "Yudi (Saif Ali Khan), a writer hasn’t penned anything in many years and is caught between finding inspiration and finding love. Will he find his Happy Ending in both love and work?",
    	"cinema" : ["The Cathay", "West Mall", "Cineleisure", "JEM", "Causeway Point", "AMK HUB", "Downtown East"],
    	"imageLink" : "http://media.gv.com.sg/imagesresize/img4454.jpg",
    	"trailerLink" : "http://youtu.be/XxU1B54LRGs" } ,

    {	"movieName":"Kung Fu Jungle", 
    	"cast" : "Donnie Yen, Wang Baoqiang, Charlie Yeung",
    	"director" : "Teddy Chan" ,
    	"genre" : "Action/ Thriller",
    	"release" :  "30-10-2014",
    	"runningTime" : "100 minutes",
    	"distributor" : "GVP" ,
    	"language" : "Mandarin(Sub: English,Chinese)",
    	"synopsis" : "A martial arts instructor from the police force gets imprisoned after killing a man by accident. But when a vicious killer starts targeting martial arts masters, the instructor offers to help the police in return for his freedom. ",
    	"cinema" : ["The Cathay", "West Mall", "Cineleisure", "JEM", "Causeway Point", "AMK HUB", "Downtown East"],
    	"imageLink" : "http://media.gv.com.sg/imagesresize/img3236.jpg",
    	"trailerLink" : "http://youtu.be/56VkC-5j_Hg?list=UUXzTlfmCw4aPk3l_HQQPqhA" } ,

    {	"movieName":"The Book Of Life", 
    	"cast" : "Channing Tatum, Zoe Saldana, Diego Luna",
    	"director" : "Jorge Gutierrez" ,
    	"genre" : "Animation",
    	"release" :  "30-10-2014",
    	"runningTime" : "96 minutes",
    	"distributor" : "Fox" ,
    	"language" : "English(Sub: Chinese)",
    	"synopsis" : "From producer Guillermo del Toro and director Jorge Gutierrez comes an animated comedy with a unique visual style. THE BOOK OF LIFE is the journey of Manolo, a young man who is torn between fulfilling the expectations of his family and following his heart. Before choosing which path to follow, he embarks on an incredible adventure that spans three fantastical worlds where he must face his greatest fears. Rich with a fresh take on pop music favorites, THE BOOK OF LIFE encourages us to celebrate the past while looking forward to the future.",
    	"cinema" : ["The Cathay", "West Mall", "Cineleisure", "JEM", "Causeway Point", "AMK HUB", "Downtown East"],
    	"imageLink" : "http://media.gv.com.sg/imagesresize/img5237.jpg",
    	"trailerLink" : "http://youtu.be/NBw5YScs8iQ" }
]